--
--1
--
SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ, Н_ВЕДОМОСТИ.ИД FROM Н_ТИПЫ_ВЕДОМОСТЕЙ
    RIGHT JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ТВ_ИД = Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД
    WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ = 'Ведомость' AND Н_ВЕДОМОСТИ.ИД > 1457443;
--
--2
--
SELECT Н_ЛЮДИ.ИМЯ, Н_ВЕДОМОСТИ.ЧЛВК_ИД, Н_СЕССИЯ.ИД FROM Н_ЛЮДИ
    LEFT JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД LEFT JOIN Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
    WHERE Н_ЛЮДИ.ИД < 100865 AND Н_ВЕДОМОСТИ.ЧЛВК_ИД < 117219 AND Н_СЕССИЯ.ЧЛВК_ИД = 126631;
--
--3
--
SELECT exists(SELECT Н_ЛЮДИ.ИД, Н_УЧЕНИКИ.ГРУППА, date_part('year', age(Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ)) as ВОЗРАСТ FROM
    Н_ЛЮДИ JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    WHERE Н_УЧЕНИКИ.ГРУППА = '3102' AND date_part('year', age(Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ)) > 25);
--
--4
--
SELECT ГРУППЫ_2011.ГРУППА, ГРУППЫ_2011.КОЛИЧЕСТВО FROM(
    SELECT Н_УЧЕНИКИ.ГРУППА, count(Н_УЧЕНИКИ.ГРУППА) as КОЛИЧЕСТВО FROM
    Н_УЧЕНИКИ JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД=Н_ПЛАНЫ.ИД JOIN Н_ОТДЕЛЫ ON Н_ОТДЕЛЫ.ИД = Н_ПЛАНЫ.ОТД_ИД
    WHERE Н_ПЛАНЫ.УЧЕБНЫЙ_ГОД = '2010/2011' AND Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ='ВТ'
    GROUP BY Н_УЧЕНИКИ.ГРУППА) as ГРУППЫ_2011
WHERE ГРУППЫ_2011.КОЛИЧЕСТВО<10;
--
--5
--
SELECT Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, avg(cast(Н_ВЕДОМОСТИ.ОЦЕНКА as int)) as СРЕДНЯЯ_ОЦЕНКА FROM
Н_ЛЮДИ JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД=Н_УЧЕНИКИ.ЧЛВК_ИД JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД=Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE Н_ВЕДОМОСТИ.ОЦЕНКА IN ('1','2','3','4','5') AND Н_УЧЕНИКИ.ГРУППА = '4100'
GROUP BY Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО
HAVING avg(cast(Н_ВЕДОМОСТИ.ОЦЕНКА as int)) = (
    SELECT avg(cast(Н_ВЕДОМОСТИ.ОЦЕНКА as int)) as СРЕДНЯЯ_ОЦЕНКА FROM
    Н_ЛЮДИ JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД=Н_УЧЕНИКИ.ЧЛВК_ИД JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД=Н_ВЕДОМОСТИ.ЧЛВК_ИД
    WHERE Н_ВЕДОМОСТИ.ОЦЕНКА IN ('1','2','3','4','5') AND Н_УЧЕНИКИ.ГРУППА='1100'
    GROUP BY Н_УЧЕНИКИ.ГРУППА
);
--
--6
--
SELECT Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, Н_УЧЕНИКИ.ГРУППА, Н_УЧЕНИКИ.СОСТОЯНИЕ, Н_УЧЕНИКИ.П_ПРКОК_ИД FROM Н_ЛЮДИ JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ИД
AND Н_УЧЕНИКИ.НАЧАЛО='2012-09-01 00:00:00' JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД=Н_ПЛАНЫ.ИД AND Н_ПЛАНЫ.КУРС='1' JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ПЛАНЫ.ФО_ИД=Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
AND Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная' JOIN Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ ON Н_ПЛАНЫ.НАПС_ИД=Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД JOIN Н_НАПР_СПЕЦ ON Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.НС_ИД=Н_НАПР_СПЕЦ.ИД
AND Н_НАПР_СПЕЦ.КОД_НАПРСПЕЦ='230101';

--
--7
--
SELECT Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО FROM Н_ЛЮДИ JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ИД
WHERE Н_ЛЮДИ.ОТЧЕСТВО IN(
    SELECT Н_ЛЮДИ.ОТЧЕСТВО FROM Н_ЛЮДИ
    GROUP BY Н_ЛЮДИ.ОТЧЕСТВО
    HAVING COUNT(Н_ЛЮДИ.ОТЧЕСТВО)>1
)
ORDER BY Н_ЛЮДИ.ОТЧЕСТВО;

